app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-08-13 00:07:34.195510"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article = Article.update(title: params[:title], description: params[:description])